In [1]:
import pandas as pd

In [3]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [11]:
df = pd.merge(employee, employee, how='inner', left_on='managerId', right_on='id', suffixes=('_e','_m'))
ds = df[df['salary_e']>df['salary_m']][['name_e']].rename(columns={'name_e':'employee'})
ds

   id_e name_e  salary_e  managerId_e  id_m name_m  salary_m  managerId_m
0     1    Joe     70000            3     3    Sam     60000         <NA>
1     2  Henry     80000            4     4    Max     90000         <NA>

In [13]:
ds = df[df['salary_e']>df['salary_m']][['name_e']].rename(columns={'name_e':'employee'})
ds

  employee
0      Joe